// 1. Напишите программу, которая отобразит ваше имя и адрес.

#include <iostream>

int main(){
    std::cout << "Name: Andrey"<< std::endl;
    std::cout << "Adress: Russia, Novosibirsk" << std::endl;
};


// ./result
//
//
